app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def index
        if params.has_key?(:user_id)
            @artworks = Artwork
                .left_outer_joins(:shares)
                .where('artist_id = :user_id OR viewer_id = :user_id', user_id: params[:user_id]).distinct
        else
            @artworks = Artwork.all

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        art = Artwork.find(params[:id])

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Nessa"], ["image_url", "www.nessa.com"], ["artist_id", 3], ["created_at", "2020-10-28 23:59:34.174962"], ["updated_at", "2020-10-28 23:59:34.174962"]]
---
    def create
        art = Artwork.new(artwork_params)
        if art.save!

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Vanessa"], ["updated_at", "2020-10-29 00:00:40.878948"], ["id", 4]]
---
    def update
        art = Artwork.find(params[:id])
        if art.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 3]]
---
    def destroy
        art = Artwork.find(params[:id])
        art.destroy