app/controllers/artwork_shares_controller.rb

    def create
        shares = ArtworkShare.new(artwork_shares_params)
        if shares.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 2], ["created_at", "2020-10-29 21:44:12.125757"], ["updated_at", "2020-10-29 21:44:12.125757"]]

    def destroy
        shares = ArtworkShare.find(params[:id])
        shares.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]