app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "artwork_id", "created_at", "updated_at", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 9], ["artwork_id", 3], ["created_at", "2020-10-29 23:52:12.470854"], ["updated_at", "2020-10-29 23:52:12.470854"], ["body", "Looking good!"]]
---
    def create
        comment = Comment.new(comments_params)
        if comment.save!