app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save!
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Vanessa"], ["email", "vanessa@appacademy.com"]]

    def update
        user = User.find(params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "nessa@appacademy.com"], ["id", 5]]